office/app/controllers/employers_controller.rb

  def create
    @name = params[:name]
    @address = params[:address]
    @employer = Employer.new(:name => params[:name], address: params[:address])
    if @employer.save
---
INSERT INTO "employers" ("name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Pavan"], ["address", "Austin"], ["created_at", "2016-02-24 17:38:28.972596"], ["updated_at", "2016-02-24 17:38:28.972596"]]

  def index
    @employers = Employer.all
---
SELECT "employers".* FROM "employers"